In [48]:
import pandas as pd

In [49]:
data=pd.read_csv("50_Startups.csv")

In [50]:
data.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [51]:
data.corr()

                 R&D Spend  Administration  Marketing Spend    Profit
R&D Spend         1.000000        0.241955         0.724248  0.972900
Administration    0.241955        1.000000        -0.032154  0.200717
Marketing Spend   0.724248       -0.032154         1.000000  0.747766
Profit            0.972900        0.200717         0.747766  1.000000

In [52]:
# since state consists strings so it does'nt shows correlation so we can not know does it affects or not

In [53]:
from sklearn.linear_model import LinearRegression

In [54]:
model=LinearRegression()

In [55]:
X=data[["R&D Spend","Administration","Marketing Spend","State"]]

In [56]:
y=data["Profit"]

In [57]:
X.head()

   R&D Spend  Administration  Marketing Spend       State
0  165349.20       136897.80        471784.10    New York
1  162597.70       151377.59        443898.53  California
2  153441.51       101145.55        407934.54     Florida
3  144372.41       118671.85        383199.62    New York
4  142107.34        91391.77        366168.42     Florida

In [58]:
# since X contains State which has strings so we can not fit data in model
# so we need to do feature Engineering and transform/encode our data to new form
# this can be done by like we can convert the given labels to some number

In [59]:
state=X["State"]

## ***One Host Encoding: for categorical variables

In [60]:
state_dummy=pd.get_dummies(state)   # encoding

In [61]:
state_dummy.head()

   California  Florida  New York
0           0        0         1
1           1        0         0
2           0        1         0
3           0        0         1
4           0        1         0

In [62]:
final_state=state_dummy.iloc[:,0:2]   #remove redundancy

In [63]:
final_state.head()

   California  Florida
0           0        0
1           1        0
2           0        1
3           0        0
4           0        1

### Replacing old data having catagorical data  with newdummy data that we created

In [64]:
X=X.iloc[:,0:3]  # removing State column from X
# row wise retriving data
#we can do same operations as numpy array

In [65]:
X.head()

   R&D Spend  Administration  Marketing Spend
0  165349.20       136897.80        471784.10
1  162597.70       151377.59        443898.53
2  153441.51       101145.55        407934.54
3  144372.41       118671.85        383199.62
4  142107.34        91391.77        366168.42

In [66]:
final_state.columns

Index(['California', 'Florida'], dtype='object')

In [67]:
X[["California","Florida"]]=final_state   #add the encoded columns

In [68]:
X.head()  #new X

   R&D Spend  Administration  Marketing Spend  California  Florida
0  165349.20       136897.80        471784.10           0        0
1  162597.70       151377.59        443898.53           1        0
2  153441.51       101145.55        407934.54           0        1
3  144372.41       118671.85        383199.62           0        0
4  142107.34        91391.77        366168.42           0        1

In [70]:
from sklearn.model_selection import train_test_split

In [71]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20, random_state=42)

In [72]:
model.fit(X_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [75]:
y_pred=model.predict(X_test)  #predicted

In [76]:
y_pred

array([126362.87908254,  84608.45383635,  99677.49425148,  46357.46068582,
       128750.48288503,  50912.41741885, 109741.35032702, 100643.24281646,
        97599.27574595, 113097.42524433])

In [74]:
y_test          #actual

13    134307.35
39     81005.76
30     99937.59
45     64926.08
17    125370.37
48     35673.41
26    105733.54
25    107404.34
32     97427.84
19    122776.86
Name: Profit, dtype: float64

In [79]:
model.coef_

array([ 8.05630064e-01, -6.87878823e-02,  2.98554429e-02, -6.98775997e+00,
        9.31805246e+02])

In [80]:
data.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

#### If asked that i want to make profit of 150000 , so i which state should i make my startup?
#### so this shows,
#### If you pay 1 unit on r&d we make profit of 8.05..
#### If you pay 1 unit on administration we make loss of 6.87..
#### If  you pay 1 unit on marketing we make profit of 2.9..
#### If you pay 1 unit on carlifornia we make loss of 6.98..
#### If you pay 1 unit on florida we make profit of 9.31..

#### so it is wise to make startup in florida then california